tutorials/NumericalExample/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -5);

boundaryField
{
    top
    {
        type           fixedValue;
        value          uniform (0 0 -5);
    }
    bottom
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type           fixedValue;
        value          uniform (0 0 -10);
    }
}


// ************************************************************************* //
