tutorials/NumericalExample/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    top
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        U               U;
        phi             phi;
        value           uniform 1;

    }
    bottom
    {
        type            zeroGradient;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        U               U;
        phi             phi;
        value           uniform 1;
    }
}


// ************************************************************************* //
