tutorials/NumericalExample/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 101325;
    }

    walls
    {
        type            fixedValue;
        value           uniform 101325;
    }

    inlet 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
