tutorials/NumericalExample/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

buoyancyForce
{
    type        buoyancyForce;
}
clusterClouds
{
    type    clusterClouds;
    libs    ("liblagrangianClusterParcel.so");
}
radiation
{
    type    radiation;
    libs    ("libradiationModels.so");
}
edmCombustion
{
    type edmCombustion;
    libs ("libedmCombustionModels.so");
}


// ************************************************************************* //
