tutorials/NumericalExample/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          hPolynomial;
    energy          sensibleEnthalpy;
    equationOfState incompressiblePerfectGas;
    specie          specie;
}

#include "speciesThermo"

fuel          volatiles;
defaultSpecie N2;

liquids
{
    H2O;
}

solids
{

    C
    {
        Cp 1680;
        emissivity 0.9;
    };
    ash
    {
        Cp 1680;
        emissivity 0.9;
    };

}


// ************************************************************************* //
