tutorials/NumericalExample/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0     0     0) //0
    (0.98  0     0) //1
    (1.02  0     0) //2
    (2     0     0) //3
    (0     0.98  0) //4
    (0.98  0.98  0) //5
    (1.02  0.98  0) //6
    (2     0.98  0) //7
    (0     1.02  0) //8
    (0.98  1.02  0) //9
    (1.02  1.02  0) //10
    (2     1.02  0) //11
    (0     2     0) //12
    (0.98  2     0) //13
    (1.02  2     0) //14
    (2     2     0) //15
    
    (0     0     8) //16
    (0.98  0     8) //17
    (1.02  0     8) //18
    (2     0     8) //19
    (0     0.98  8) //20
    (0.98  0.98  8) //21
    (1.02  0.98  8) //22
    (2     0.98  8) //23
    (0     1.02  8) //24
    (0.98  1.02  8) //25
    (1.02  1.02  8) //26
    (2     1.02  8) //27
    (0     2     8) //28
    (0.98  2     8) //29
    (1.02  2     8) //30
    (2     2     8) //31
);

blocks
(
    //auessere Bloecke
    hex (0 1 5 4 16 17 21 20)     (30 30 200) simpleGrading (0.5 0.5   1)
    hex (8 9 13 12 24 25 29 28)   (30 30 200) simpleGrading (0.5   2     1)
    hex (2 3 7 6 18 19 23 22)     (30 30 200) simpleGrading (2 0.5   1)
    hex (10 11 15 14 26 27 31 30) (30 30 200) simpleGrading (2 2 1)
    
    //mitte aussen Bloecke
    hex (1 2 6 5 17 18 22 21)     (4 30 200) simpleGrading (1   0.5   1)
    hex (9 10 14 13 25 26 30 29)  (4 30 200) simpleGrading (1   2 1)
    hex (4 5 9 8 20 21 25 24)     (30 4 200) simpleGrading (0.5   1   1)
    hex (6 7 11 10 22 23 27 26)   (30 4 200) simpleGrading (2 1   1)
    
    //innerer Block
    hex (5 6 10 9 21 22 26 25)    (4 4 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            (20 21 25 24)
            (22 23 27 26)
            (24 25 28 29)
            (25 26 30 29)
            (26 27 30 31)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (21 22 26 25)
        );
    }
    walls
    {
        type wall;
        faces
        (
             (0 16 20 4)
             (4 20 24 8)
             (8 24 28 12)
             
             (12 28 29 13)
             (13 29 30 14)
             (14 30 31 15)
             
             (15 31 27 11)
             (11 27 23 7)
             (7 23 19 3)
             
             (0 1 17 16)
             (1 2 18 17)
             (2 3 18 19)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
