tutorials/NumericalExample/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    runTime;

writeInterval   600;

purgeWrite      10;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxDeltaT       1;

libs
(
);

functions
{
    residuals
    {
        functionObjectLibs ("libutilityFunctionObjects.so");
        type            residuals;
        writeControl    timeStep;
        writeInterval   1;
        fields
        (
            U
            Uy
            Uz
            O2
            H2O
            CH4
            CO2
            h
            p
            epsilon
            k
        );
    }
}

// ************************************************************************* //
